{"name":"Delphi","children":[{"name":"","children":[{"url":"http://sourceforge.net/projects/jvcl","size":1,"name":"JVCL","description":"Library of over 600 Delphi components developed by \"Project JEDI\" members.\r"},{"url":"http://sourceforge.net/projects/alcinoe","size":1,"name":"Alcinoe","description":"Components suite for Delphi.\r"},{"url":"http://sourceforge.net/projects/fundementals","size":1,"name":"Fundamentals Code Library","description":"Collection of Delphi / FreePascal code units. Includes libraries for Unicode, Strings, Data Structures, Sockets and Mathematics.\r"},{"url":"https://bitbucket.org/sglienke/spring4d","size":1,"name":"Spring4D","description":"Open-source code library for Embarcadero Delphi 2010 and higher. It consists of a number of different modules that contain a base class library (common types, interface based collection types, reflection extensions) and a dependency injection framework. Includes Encryption Library.\r"},{"url":"https://github.com/chaosben/theunknownones","size":1,"name":"TheUnknownOnes","description":"Huge heap of classes, components, utilities for almost every purpose. Nearly undocumented and seems not very up-to-date though.\r"},{"url":"https://github.com/cnpack/cnvcl","size":1,"name":"CNVCL","description":"CnPack Component Package. Large collection of visual components, classes and utilities. // *Lots of useful stuff; documentation and comments mainly in Chinese*\r"},{"url":"https://github.com/synopse/mORMot","size":1,"name":"mORMot","description":"Client-Server ORM/ODM SOA MVC framework for Delphi 6 and higher, or FPC 2.7. Direct SQL/NoSQL database access, ORM/ODM over objects, RESTful ORM and SOA services via interfaces over high performance HTTP server, MVC/MVVM web sites, testing including mocks and stubs, logging, huge documentation.\r"}]},{"name":"Audio","children":[{"url":"http://mac.sourceforge.net/atl","size":1,"name":"Audio Tools Library","description":"For manipulating many audio formats file information.\r"},{"url":"http://sourceforge.net/projects/delphiasiovst","size":1,"name":"Delphi ASIO & VST Project","description":"Framework for writing applications using the ASIO interface and VST plugins. It comes with countless DSP algorithms all demonstrated in dozens of examples.\r"},{"url":"http://code.google.com/p/newac","size":1,"name":"NewAC — New Audio Components","description":"Designed to help your Delphi programs perform different sound processing tasks. With NewAC you can play audio stored in many formats (wav, Ogg Vorbis, FLAC, Monkey Audio, WavPack, MP3, Windows WMA, DTS, AC-3 (Dobly Surround), VOB (DVD files)).\r"},{"url":"https://sourceforge.net/projects/audorra","size":1,"name":"Audorra","description":"Digital audio library for Delphi and Freepascal. Using a flexible plugin architecture, it allows you to exchange the audio backend (e.g. WaveOut, OpenAL), add protocol classes (e.g. file, http) and decoders.\r"}]},{"name":"Video","children":[{"url":"https://code.google.com/p/dspack","size":1,"name":"DSPack","description":"Set of components and classes to write Multimedia Applications using MS Direct Show and DirectX technologies.\r"},{"url":"https://github.com/Laex/Delphi-OpenCV","size":1,"name":"Delphi-OpenCV","description":"Translation of OpenCV library header files in Delphi\r"},{"url":"http://prog.olsztyn.pl/paslibvlc","size":1,"name":"PasLibVlc","description":"Interface to VideoLAN libvlc.dll and VCL player component for Delphi / FreePascal based on VideoLAN\r"}]},{"name":"Graphic","children":[{"url":"http://sourceforge.net/projects/graphics32","size":1,"name":"Graphics32","description":"Designed for fast 32-bit graphics handling on Delphi, Kylix and Lazarus. Optimized for 32-bit pixel formats, it provides fast operations with pixels and graphic primitives, and in most cases Graphics32 outperforms the standard TCanvas classes. It is almost a hundred times faster in per-pixel access and about 2-5 times faster in drawing lines.\r"},{"url":"http://www.delphi-gems.com/index.php/libs/graphicex-library","size":1,"name":"GraphicEx","description":"Addendum to Delphi's Graphics.pas to enable your application to load many common image formats. This library is primarily designed to load images as background (buttons, forms, toolbars) and textures (DirectX, OpenGL) or for image browsing and editing purposes as long as you don't need to save images.\r"},{"url":"http://imaginglib.sourceforge.net","size":1,"name":"Vampyre Imaging Library","description":"Cross-platform native Object Pascal (Delphi and Free Pascal) image loading, saving, and manipulation library.\r"},{"url":"https://code.google.com/p/ccr-exif","size":1,"name":"CCR-EXIF","description":"Library to read and write Exif, IPTC and XMP metadata from JPEG, TIFF and PSD images.\r"},{"url":"http://www.tkweb.eu/en/delphicomp/kicon.html","size":1,"name":"KIcon","description":"This component makes sense if a more complex manipulation with icons (or better icon files *.ico) than just viewing is needed. Full PNG icon image support, correct rendering, icons with alpha channel.\r"},{"url":"http://www.kluug.net/delphitwain.php","size":1,"name":"Delphi Twain","description":"The library allows you to easily access scanning functions from Delphi and Lazarus.\r"},{"url":"https://github.com/synopse/SynPDF","size":1,"name":"Synopse PDF","description":"Fully featured Open Source PDF document creation library for Delphi, embedded in one unit. Pure Delphi code, Delphi 5 up to XE7, for Win32 and Win64 platforms.\r"},{"url":"https://github.com/TurboPack/PowerPDF","size":1,"name":"PowerPDF","description":"VCL component to create PDF docment visually. Like Forms, you can design PDF document easily on Delphi or C++Builder IDE.\r"},{"url":"https://sourceforge.net/projects/igdiplus","size":1,"name":"IGDI+","description":"The free open source library allows quick and easy implementations of complex GDI+ applications, in a natural Delphi-friendly code.\r"},{"url":"https://sourceforge.net/projects/glscene","size":1,"name":"GLScene","description":"OpenGL based 3D library for Delphi. It provides visual components and objects allowing description and rendering of 3D scenes in an easy, no-hassle, yet powerful manner. GLScene is not just an OpenGL wrapper or utility library, it has grown to become a set of founding classes for a generic 3D engine with Rapid Application Development in mind. GLScene allows you to quickly design and render 3D scenes without having to learn the intricacies of OpenGL, if you know how to design a TForm, you'll easily master the basic operations of GLScene. The library comes with a large collections of demos showcasing the ease of use, and demonstrating RAD wasn't done at the expense of CPU/GPU horsepower.\r"},{"url":"https://github.com/synopse/mORMot/blob/master/SynGdiPlus.pas","size":1,"name":"SynGdiPlus","description":"Enables an application to load and save GIF, TIF, PNG and JPG pictures. It also allows anti-aliased drawing from any TMetaFile. That is, you can play a .emf content using GDI+ instead of GDI, for much better rendering result.\r"},{"url":"https://github.com/synopse/mORMot/blob/master/SQLite3/mORMotReport.pas","size":1,"name":"TGdiPages","description":"[docs](http://synopse.info/files/html/api-1.18/mORMotReport.html)). Fast and efficient code-based reporting component, with preview form and PDF export.\r"},{"url":"http://sourceforge.net/projects/andorra","size":1,"name":"Andorra 2D","description":"New generation 2D Engine for Delphi and Lazarus. Andorra 2D is capable to use DirectX or OpenGL through graphic plugins. Andorra 2D is built in a very modular way and is yet easy to use.\r"},{"url":"https://github.com/vintagedave/transparent-canvas","size":1,"name":"Transparent-canvas","description":"Delphi VCL / Windows project for drawing semi-transparent alphablended graphics. It provides a class similar to TCanvas.\r"},{"url":"https://github.com/vintagedave/fully-justified-text","size":1,"name":"Fully-justified-text","description":"Delphi VCL / Windows project for text output, allowing printing of fully justified text with a variety of options.\r"},{"url":"https://github.com/Memnarch/AsciiImage","size":1,"name":"AsciiImage","description":"AsciiImage-Implementation for Delphi by Alexander Benikowski based on AsciiImage by Charles Parnot. Read more on [his article](http://cocoamine.net/blog/2015/03/20/replacing-photoshop-with-nsstring).\r"},{"url":"https://github.com/BeRo1985/kraft","size":1,"name":"Kraft Physics Engine","description":"Open source Object Pascal physics engine library that can be used in 3D games. Compatible with: Delphi 7-XE7 (but not with the Android and iOS targets), FreePascal >= 2.6.2 (with almost all FPC-supported targets including Android and iOS) \r"}]},{"name":"Network","children":[{"url":"http://www.overbyte.be/frame_index.html","size":1,"name":"Internet Component Suite","description":"Asynchronous-based library composed of various Internet components and applications. Clients/servers for TCP, UDP, raw sockets, FTP, SMTP, POP3, NNTP, HTTP, Telnet and more. Supports SSL and TLS with the help of OpenSSL. Also includes Mime Decoder, SHA1/MD4/MD5 hashes, DES encryption.\r"},{"url":"https://code.google.com/p/indyproject","size":1,"name":"Indy","description":"Network components for Delphi, C++Builder, Delphi.NET, and FreePascal\r"},{"url":"https://sourceforge.net/p/synalist","size":1,"name":"Ararat Synapse","description":"Pascal TCP/IP Library for Dephi, C++Builder, Kylix and FreePascal. Deals with network communication by means of blocking (synchronous) sockets or with limited non-blocking mode. This project not using asynchronous sockets! The Project contains simple low level non-visual objects for easiest programming without problems (no required multithread synchronisation, no need for windows message processing,…) Great for command line utilities, visual projects, NT services,…\r"},{"url":"http://sourceforge.net/projects/tpipro2010","size":1,"name":"Internet Professional","description":"Set of VCL components providing Internet connectivity for Borland Delphi & C++Builder. iPRO includes POP3, SMTP, NNTP, FTP, HTTP, Instant Messaging, & HTML viewer components, as well as components for low-level socket access.\r"},{"url":"https://github.com/synopse/mORMot/blob/master/SynCrtSock.pas","size":1,"name":"SynCrtSock","description":"Features several sockets and HTTP client-server classes, including a high-performance http.sys based server under Windows, and a new thread-pool powered socket server.\r"}]},{"name":"Serial port","children":[{"url":"http://sourceforge.net/p/synalist/code/HEAD/tree/trunk/synaser.pas","size":1,"name":"Synaser","description":"Library for blocking communication on serial ports. It is non-visual class as in Synapse, and programmer interface is very similar to Synapse.\r"},{"url":"http://sourceforge.net/projects/tpapro","size":1,"name":"Async Professional","description":"[Newest](https://github.com/TurboPack/AsyncPro) and maintained version for recent compiler version only). Comprehensive communications toolkit for Embarcadero Delphi, C++Builder, & ActiveX environments. It provides direct access to serial ports, TAPI and the Microsoft Speech API (TTS/Speech recognition). It supports faxing, terminal emulation, VOIP, RAS dial & more.\r"}]},{"name":"Control packs","children":[{"url":"http://sourceforge.net/projects/tcycomponents","size":1,"name":"Cindy components","description":"Packages with 71 components: VCL controls (labels, buttons, panels, Edits, TabControls, StaticText) with features like background gradient, colored bevels, wallpaper, shadowText, caption orientation etc...\r"},{"url":"http://sourceforge.net/projects/tporpheus","size":1,"name":"Orpheus","description":"[Newest](https://github.com/TurboPack/Orpheus) and maintained version for recent compiler version only). Award-winning UI toolkit for Borland Delphi & C++Builder. It contains over 120 components covering everything from data entry to calendars and clocks. Other noteworthy components include an Object Inspector, LookOut bar & report views.\r"},{"url":"http://www.tkweb.eu/en/delphicomp/kcontrols.html","size":1,"name":"KControls","description":"Control components. All controls have been written with the aim to become both cross-IDE compatible (Delphi/C++Builder VCL and Lazarus LCL) and cross-platform compatible in Lazarus.\r"},{"url":"http://sourceforge.net/projects/dpfdelphiandroid","size":1,"name":"D.P.F Delphi Android","description":"[D.P.F Delphi iOS](http://sourceforge.net/projects/dpfdelphiios) native components. D.P.F Delphi Native Components, 100% iOS Performance and styles. Develop iPhone & iPad & iPod Touch applications with fast native performance and native styles. Use native Android controls and services. Fast native performance. Mixed with FM VCL controls. Can be quick updated with latest Android controls & features.\r"},{"url":"https://github.com/TurboPack/Essentials","size":1,"name":"Essentials","description":"Contains 13 native VCL controls for Embarcadero Delphi and C++Builder. The controls include drop-down calendars and calculators, roll-up dialogs, 3-D labels, tiled backgrounds, scrolling messages, menu buttons, and more.\r"}]},{"name":"Single controls","children":[{"url":"http://code.google.com/p/mustangpeakeasylistview","size":1,"name":"EasyListView","description":"Part of VirtualShellTools for the Listview but can be used for a TListview Replacement that is faster and more customizable.\r"},{"url":"https://github.com/Virtual-TreeView/Virtual-TreeView","size":1,"name":"VirtualTreeView","description":"Treeview control built from ground up. Many years of development made it one of the most flexible and advanced tree controls available today.\r"},{"url":"https://code.google.com/p/delphichromiumembedded","size":1,"name":"Delphi Chromium Embedded","description":"Embedding Chromium in Delphi, tested on Delphi 2010, XE, XE2, Delphi 7.\r"},{"url":"https://github.com/norgepaul/tchrometabs","size":1,"name":"TChromeTabs","description":"Comprehensive implementation of Google Chrome's tabs for Delphi 6 - Delphi XE8\r"}]},{"name":"Editors","children":[{"url":"https://sourceforge.net/projects/synedit","size":1,"name":"SynEdit","description":"[mirror at GitHub](https://github.com/TurboPack/SynEdit)). Syntax highlighting edit control, not based on the Windows common controls. SynEdit is compatible with both Delphi and Kylix\r"},{"url":"https://github.com/bonecode/TBCEditor","size":1,"name":"TBCEditor","description":"A syntax highlighting edit control with code folding, minimap, external JSON highlighter and color scheme files, etc.\r"}]},{"name":"Viewers","children":[{"url":"https://sourceforge.net/projects/atviewer","size":1,"name":"ATViewer","description":"Delphi components to view various file types: text, binary, images, multimedia, webpages, etc.\r"},{"url":"https://sourceforge.net/projects/atviewer/files/ATImageMap","size":1,"name":"ATImageMap","description":"Component designed to show many images (parts of the whole image) as a single map. For example, you may have array of images, 200 by X, and 100 by Y — control will show them as a single map. Component also allows to draw paths: each path consists of many lines, points, and icons.\r"},{"url":"https://github.com/BerndGabriel/HtmlViewer","size":1,"name":"HtmlViewer","description":"Delphi/Lazarus HtmlViewer/FrameViewer.\r"}]},{"name":"Other GUI","children":[{"url":"https://code.google.com/p/gmlibrary","size":1,"name":"GMLib","description":"Google Maps Library). Components for Delphi/C++ Builder that encapsulate the GoogleMaps API to administrate a map, markers, polygons, rectangles, polylines,... All objects that you can put into a map.\r"},{"url":"https://github.com/rruz/vcl-styles-utils","size":1,"name":"VCL Styles Utils","description":"Collection of classes and style hooks, which extend, fix QC reports and add new features to the VCL Styles.\r"},{"url":"https://github.com/chaosben/theunknownones","size":1,"name":"TaskbarListComponents","description":"Set of components designed as Delphi wrappers for the Windows 7 Taskbarlist Interfaces (e.g. ITaskbarlist3)\r"},{"url":"https://github.com/vintagedave/firemonkey-container","size":1,"name":"TFireMonkeyContainer","description":"Delphi VCL component to host a FMX HD or 3D form. It means you can embed a FireMonkey (FMX) form as a control in a VCL form, so you can design a FMX form and use it in your VCL app.\r"},{"url":"http://sourceforge.net/projects/pascalscada","size":1,"name":"PascalSCADA","description":"Set of components (framework) for Delphi/Lazarus to make easy the development of industrial applications (HMI=Human Machine Interface/SCADA=System Control And Data Acquisition). It runs on Windows, Linux and FreeBSD.\r"}]},{"name":"","children":[{"url":"http://sourceforge.net/projects/zeoslib","size":1,"name":"ZeosLib","description":"Set of database components for MySQL, PostgreSQL, Interbase, Firebird, MS SQL, Sybase, Oracle and SQLite.\r"},{"url":"http://sourceforge.net/projects/uib","size":1,"name":"Unified Interbase","description":"Set of components to use Interbase, FireBird and YAFFIL. These components were born from the need to use Interbase, FireBird or Yaffil indifferently as fast as possible in a Multithreading environment, a Server for example.\r"},{"url":"https://github.com/remobjects/ASQLite3","size":1,"name":"ASQLite","description":"Delphi SQLite set of DAC components from aducom software, based on their latest release for Delphi 2009, and updated to support newer editions of Delphi as included in RemObjects Data Abstract for Delphi.\r"},{"url":"https://github.com/ccy/txquery","size":1,"name":"TxQuery","description":"TDataSet descendant component that can be used to query one or more TDataSet descendant components using SQL statements. It is implemented in Delphi 100% source code, no DLL required, because it implements its own SQL syntax parser and SQL engine.\r"},{"url":"https://code.google.com/p/delphi-orm","size":1,"name":"Delphi-ORM","description":"Object-Relational Mapping for Delphi XE7, XE6, XE5, XE4, XE3 and XE2 (Win32). Supports for FirebirdSQL, SQLServer and SQLite3.\r"},{"url":"https://code.google.com/p/delphimemcache","size":1,"name":"delphimemcache","description":"Implements a thread safe client for memcached.\r"},{"url":"https://github.com/synopse/mORMot/blob/master","size":1,"name":"SynDB","description":"[docs](http://synopse.info/files/html/Synopse%20mORMot%20Framework%20SAD%201.18.html#TITL_126)). High performance direct access to SQLite3, Oracle, MSSQL, PostgreSQL, Firebird, MySQL, ODBC, OleDB, including remote HTTP connection and direct JSON support.\r"},{"url":"https://github.com/synopse/mORMot/blob/master/SynMongoDB.pas","size":1,"name":"SynMongoDB","description":"[docs](http://blog.synopse.info/post/2014/05/07/MongoDB-database-access)). Offers direct low-level access to any MongoDB server, its custom data types, JSON or via `TDocVariant` custom variant document storage.\r"},{"url":"https://bitbucket.org/sglienke/dsharp","size":1,"name":"DSharp","description":"Small library for providing data binding in Delphi. It does not require special components to data bind to properties. It also provides dependency injection, MVVM and more interesting utilities.\r"},{"url":"https://github.com/leledumbo/ghORM","size":1,"name":"ghORM","description":"Object Relational Mapping unit to ease database access from Free Pascal, by abstracting the backend and simple data retrieval (with filtering), insertion and update.\r"}]},{"name":"","children":[{"url":"https://github.com/remobjects/pascalscript","size":1,"name":"Pascal Script","description":"Free scripting engine that allows you to use most of the Object Pascal language within your Delphi or Free Pascal projects at runtime. Written completely in Delphi, it is composed of a set of units that can be compiled into your executable, eliminating the need to distribute any external files. Pascal Script started out as a need for a good working script, when there were none available at the time.\r"},{"url":"https://bitbucket.org/egrange/dwscript","size":1,"name":"DWScript","description":"Object-oriented scripting engine for Delphi based on the Delphi language, with extensions borrowed from other Pascal languages (FreePascal, Prism, etc.). It introduces a few Pascal language extensions of its own as well.\r"},{"url":"https://code.google.com/p/delphi-javascript","size":1,"name":"Delphi-Javascript","description":"Javascript engine for delphi based on Mozilla's Spidermonkey.\r"},{"url":"http://sourceforge.net/projects/blaise","size":1,"name":"Blaise","description":"Open-source object-oriented scripting language. Language features: Object-oriented; Unicode support; Optional typing, ie dynamic or static typing; Richly typed; Higher-level mathematics support, for example Complex numbers, Rational numbers and Matrices; Virtual Machine architecture; Co-routines; Familiar language syntax, influenced by Object Pascal, Python and Ada.\r"},{"url":"https://github.com/synopse/mORMot","size":1,"name":"SpiderMonkey","description":"Binding for Mozilla JavaScript engine, including JIT and multi-threading, with easy objects access via Delphi variants.\r"},{"url":"https://github.com/BeRo1985/besen","size":1,"name":"BESEN","description":"Complete ECMAScript Fifth Edition Implemention in Object Pascal, which is compilable with Delphi >=7 and Free Pascal >= 2.5.1 (maybe also 2.4.1).\r"}]},{"name":"Compression","children":[{"url":"https://github.com/AlexanderBagel/FWZip","size":1,"name":"FWZip","description":"Classes to work with Zip archives using Store and Deflate methods, supports ZIP64, DataDescryptors, PKWARE encryption, NTFS attributes, Utf8 in filenames.\r"},{"url":"http://sourceforge.net/p/tpabbrevia","size":1,"name":"Abbrevia","description":"[Newest](https://github.com/TurboPack/Abbrevia) and maintained version for recent compiler version only). Advanced data compression toolkit for Delphi and C++Builder. Supports PKZIP, Microsoft CAB, tar, gzip, and bzip2 archives, and can create self-extracting executables. On Windows it also provides Delphi wrappers for the LZMA, Bzip2, and WavPack SDKs, and PPMd decompression. Abbrevia also has several visual controls that simplify displaying and manipulating archives, including treeview and listview components. Features: Unicode filenames in all archive formats; Decompress most .zipx and legacy (PKZIP v1) zips; ZIP64 support for archives larger than 2GB; Spanned and split zip archives; Cross-platform (Windows, OS X, and Linux); No DLLs required; Includes COM component; Extensive documentation\r"},{"url":"https://github.com/synopse/mORMot","size":1,"name":"SynLZ SynLZO SynZip","description":"Several high speed compression units, featuring ZIP, LZO and SynLZ algorithm, in pascal and optimized assembler.\r"}]},{"name":"Encryption","children":[{"url":"https://github.com/winkelsdorf/DelphiEncryptionCompendium/releases","size":1,"name":"Delphi Encryption Compendium (DEC)","description":"Cryptographic library for Delphi & C++ Builder. Symmetric cryptographic functions: Blowfish, Twofish, IDEA, Cast128, Cast256, Mars, RC2, RC4, RC5, RC6, Rijndael / AES, Square, SCOP, Sapphire, 1DES, 2DES, 3DES, 2DDES, 3DDES, 3TDES, 3Way, Gost, Misty, NewDES, Q128, SAFER, Shark, Skipjack, TEA, TEAN; Block cipher modes of operation: CTSx, CBCx, CFB8, CFBx, OFB8, OFBx, CFSx, ECBx; Hashes: MD2, MD4, MD5, RipeMD128, RipeMD160, RipeMD256, RipeMD320, SHA, SHA1, SHA256, SHA384, SHA512, Haval128, Haval160, Haval192, Haval224, Haval256, Tiger, Panama, Whirlpool, Whirlpool1, Square, Snefru128, Snefru256, Sapphire.\r"},{"url":"http://sourceforge.net/projects/tplockbox","size":1,"name":"LockBox","description":"[Newest](https://github.com/TurboPack/LockBox3) and maintained version for recent compiler version only). Delphi library for cryptography. Currently supported Delphi XE6. It provides support for AES, DES, 3DES, Blowfish, Twofish, SHA2 (including the new SHA-512/224 & SHA-512/256), MD5; ECB, CBC, CFB8, CFB, CTR, ECB, OFB, PCBC chaining modes, RSA digital signature and verification. Has interface to OpenSSL library.\r"},{"url":"https://github.com/synopse/mORMot/blob/master/SynCrypto.pas","size":1,"name":"SynCrypto","description":"Fast cryptographic routines (hashing and cypher), implementing AES, XOR, RC4, ADLER32, MD5, SHA1, SHA256 algorithms, optimized for speed (tuned assembler and VIA PADLOCK optional support).\r"},{"url":"https://bitbucket.org/sergworks/tforge","size":1,"name":"TForge","description":"Open-source crypto library written in Delphi, compatible with Free Pascal Compiler. MD5, SHA1, SHA256, CRC32, Jenkins-One-At-Time, HMAC, PBKDF1, PBKDF2, AES, DES, RC4, RC5, Salsa20.\r"}]},{"name":"XML/JSON","children":[{"url":"http://sourceforge.net/projects/saxforpascal","size":1,"name":"SAX for Pascal","description":"Designed to implement the Simple API for XML Parsing in Pascal/Delphi.\r"},{"url":"http://sourceforge.net/projects/kdsxml","size":1,"name":"KDS XML","description":"Class library for streamed parsing, validating and generating XML. It is written in Object Pascal/Delphi and works on Win32 (Delphi) and Linux (Kylix). Parts of it depend on the SAX for Pascal interface specifications.\r"},{"url":"http://sourceforge.net/projects/tpxmlpartner","size":1,"name":"XML Partner","description":"Helps add the power of XML to Borland Delphi, C++ Builder, and Kylix projects through native, easy to use VCL and CLX components. These powerful components simplify the process of creating, modifying, and parsing XML data documents.\r"},{"url":"http://www.philo.de/xml/downloads.shtml","size":1,"name":"Open XML","description":"Provides a wide range of methods, components and foundation classes. It can be used for Win32/Kylix as well as for .NET development.\r"},{"url":"https://github.com/hgourvest/superobject","size":1,"name":"SuperObject","description":"Parser/writer for JSON data format. This toolkit is designed to work with Delphi and FreePascal (win32, win64, linux32, linux64, MacOSX Intel)\r"},{"url":"http://www.kluug.net/oxml.php","size":1,"name":"OXml","description":"New XML library for Delphi and Lazarus, developed in late 2013. I took some inspiration from OmniXML but wrote the library completely from scratch. The aim of OXml is to be the most versatile and fastest XML library for the Pascal language. OXml features a SAX parser, DOM implementation, a sequential DOM parser a direct XML reader/writer and a vendor for Delphi's XmlIntf.TXMLDocument. OXml supports all Delphi versions starting from Delphi 4 on all platforms: Win32, Win64, OSX, iOS, Android. OXml supports Lazarus 1.0 and newer on all platforms (tested Win32, Win64, Linux, MacOSX).\r"},{"url":"https://sourceforge.net/projects/libxml2-pas","size":1,"name":"Libxml2 for pascal","description":"Pascal units accessing the popular XML API from Daniel Veillard. This should be usable at least from Kylix and Delphi, but hopefully also from other Pascal compilers (like freepascal).\r"},{"url":"https://code.google.com/p/simdesign","size":1,"name":"NativeXml","description":"This component contains a small-footprint Object Pascal (Delphi) XML implementation that allows to read and write XML documents. You basically only need one unit and you can simply add it to the \"uses\" clause. You can use this software to read XML documents from files, streams or strings. The load routine generates events that can be used to display load progress on the fly. You can also use it to create and save XML documents.\r"},{"url":"http://code.google.com/p/jsonchimera","size":1,"name":"Chimera","description":"Open Source (MIT License) library for Delphi XE2 which provides a fast and cross platform JSON generator/parser (serializer/deserializer) under a license that doesn't suck.\r"},{"url":"https://github.com/synopse/mORMot/blob/master/SynCommons.pas","size":1,"name":"SynCommons","description":"High speed JSON library, using `TDocVariant` custom variant type for storage and access.\r"},{"url":"https://github.com/synopse/mORMot/blob/master/CrossPlatform/SynCrossPlatformJSON.pas","size":1,"name":"SynCrossPlatformJSON","description":"High speed cross-platform JSON library, using `TJSONVariant` custom variant type for storage and access.\r"}]},{"name":"Language","children":[{"url":"https://github.com/RomanYankovsky/ndyacclex","size":1,"name":"Next Delphi Yacc & Lex","description":"Parser generator toolset for Delphi.\r"},{"url":"https://github.com/RomanYankovsky/DelphiAST","size":1,"name":"Abstract Syntax Tree Builder","description":"With DelphiAST you can take real Delphi code and get an abstract syntax tree. One unit at time and without a symbol table though.\r"},{"url":"https://github.com/jacobthurman/Castalia-Delphi-Parser","size":1,"name":"Castalia-Delphi-Parser","description":"These files make up a hand-written high speed parser for the Object Pascal dialect known as \"Delphi\". The original work was done by Martin Waldenburg in the late 1990s, and the project was abandoned sometime before 2003, when I found the code and began working on it.  I have kept it updated as necessary to work with my project, called \"Castalia\".\r"}]},{"name":"System","children":[{"url":"http://sourceforge.net/projects/fastmm","size":1,"name":"FastMM","description":"Lightning fast replacement memory manager for Embarcadero Delphi Win32 and Win64 applications that is not prone to memory fragmentation, and supports shared memory without the use of external .DLL files.\r"},{"url":"https://github.com/gabr42/OmniThreadLibrary","size":1,"name":"OmniThreadLibrary","description":"Simple to use threading library for Delphi.\r"},{"url":"https://github.com/andremussche/scalemm","size":1,"name":"ScaleMM","description":"Fast scaling memory manager for Delphi\r"},{"url":"https://github.com/mahdisafsafi/delphi-detours-library","size":1,"name":"Delphi Detours Library","description":"Library allowing you to hook Delphi functions and object methods and Windows API functions. It provides an easy way to insert and remove hook.\r"},{"url":"https://github.com/Fr0sT-Brutal/Delphi_MemoryModule","size":1,"name":"MemoryModule","description":"With the MemoryModule engine you can store all required DLLs inside your binary to keep it standalone. Additional hook units allow transparent using of MM engine thus allowing switching MM/WinAPI loading as well as enabling 3rd party dynamic-load DLL interfaces that are unaware of MM (tested with Interbase Express components and Firebird client library). MemoryModule is a Pascal port of Joachim Bauch's C MemoryModule.\r"}]},{"name":"Other non-visual","children":[{"url":"http://regexpstudio.com/TRegExpr/TRegExpr.html","size":1,"name":"TRegExpr","description":"Easy to use and powerful tool for sophisticated search and substitutioning and for template-based text input check.\r"},{"url":"https://github.com/BeRo1985/flre","size":1,"name":"FLRE","description":"FLRE ( F ast L ight R egular E xpressions) is a fast, safe and efficient regular expression library, which is implemented in Object Pascal (Delphi and Free Pascal) but which is even usable from other languages like C/C++ and so on.\r"},{"url":"http://sourceforge.net/projects/tponguard","size":1,"name":"OnGuard","description":"[Alternate](https://github.com/TurboPack/OnGuard-VCL) and maintained version for recent compiler version only). Library to create demo versions of your Borland Delphi & C++Builder applications. Create demo versions that are time-limited, feature-limited, limited to a certain number of uses, or limited to a certain # of concurrent network users.\r"},{"url":"https://github.com/chaosben/theunknownones","size":1,"name":"StringSimilarity","description":"Package designed for some fuzzy and phonetic string comparison algorithms. So far implemented are the following algorithms: DamerauLevenshtein, Koelner Phonetik, SoundEx, Metaphone, DoubleMetaphone, NGram, Dice, JaroWinkler, NeedlemanWunch, SmithWatermanGotoh, MongeElkan.\r"},{"url":"https://github.com/danieleteti/delphistompclient","size":1,"name":"STOMP Client","description":"STOMP client for Embarcadero Delphi and FreePascal. The project can use INDY (Delphi) or Synapse (Delphi or FreePascal).\r"},{"url":"https://code.google.com/p/pubsubchimera","size":1,"name":"PubSub Chimera","description":"Open Source (MIT License) library for Delphi which provides a fast and cross platform PubSub and Message Queue implementation under a license that doesn't suck.\r"},{"url":"https://code.google.com/p/duckduckdelphi","size":1,"name":"DuckDuckDelphi","description":"Adds simple duck typing to Delphi Objects and provides an RTTI helper class to simplify many common RTTI tasks.\r"},{"url":"https://github.com/quartexNOR/byterage","size":1,"name":"byterage","description":"Object pascal class library designed to remove some of the limitations of streams. The framework is very simple to use, with only one common ancestor class (TBRBuffer) which defines a set of storage agnostic mechanisms for allocating, scaling, inserting, deleting and otherwise manipulating a segment of raw binary data.\r"},{"url":"https://github.com/SirRufo/stateless","size":1,"name":"stateless","description":"Simple library for creating state machines in Delphi code.\r"}]},{"name":"","children":[{"url":"http://sourceforge.net/projects/glibwmi","size":1,"name":"GLibWMI","description":"Component Library for Delphi that encapsulate the classes for access to WMI of Windows in a set of VCL. BiosInfo, PrinterInfo, DiskInfo,... Allow access WMI Classes: WIN32_Bios, WIN32_Printers, WIN32_DiskDrive.\r"},{"url":"https://github.com/AlexanderBagel/ProcessMemoryMap/tree/master/MemoryMap","size":1,"name":"MemoryMap","description":"Set of classes to get all the info about a memory of a running process.\r"},{"url":"https://github.com/landrix/The-new-Drag-and-Drop-Component-Suite-for-Delphi","size":1,"name":"The new Drag and Drop Component Suite","description":"VCL component library that enables your Delphi and C++Builder applications to support COM based drag and drop and integrate with the Windows clipboard.\r"},{"url":"https://github.com/RRUZ/tsmbios","size":1,"name":"TSMBIOS","description":"Allows access the System Management BIOS (SMBIOS) using the Object Pascal language (Delphi or Free Pascal). The SMBIOS (System Management BIOS) is a standard developed by the DMTF. The information stored in the SMBIOS includes devices manufacturer, model name, serial number, BIOS version, asset tag, processors, ports and device memory installed.\r"}]},{"name":"","children":[{"url":"https://github.com/VSoftTechnologies/DUnitX","size":1,"name":"DUnitX","description":"New test framework, taking ideas from DUnit, NUnit and other test frameworks. It is designed to work with Delphi 2010 or later, it makes use of language/RTL features that are not available in older versions of Delphi.\r"},{"url":"http://dunit.sourceforge.net","size":1,"name":"DUnit","description":"Unit Testing Framework, that has been the standard testing framework for years, the Delphi IDE now ships with this library. In addition to the drag and drop components, the Drag and Drop Component Suite also includes components that can be used to build Windows Shell Extensions.\r"},{"url":"http://dunit2.sourceforge.net","size":1,"name":"DUnit2","description":"Fork of the DUnit Project that adds several new features.\r"},{"url":"https://github.com/RomanYankovsky/DelphiSpec","size":1,"name":"DelphiSpec","description":"Library for running automated tests written in plain language. Because they're written in plain language, they can be read by anyone on your team. Because they can be read by anyone, you can use them to help improve communication, collaboration and trust on your team.\r"},{"url":"https://github.com/VSoftTechnologies/Delphi-Mocks","size":1,"name":"Delphi-Mocks","description":"Simple mocking framework for Delphi XE2 or later. Allow you to mock both classes and interfaces for testing. \r"},{"url":"https://github.com/VSoftTechnologies/DUnit-XML","size":1,"name":"DUnit-XML","description":"Test runner that allows DUnit Tests to output NUnit compatible XML.\r"}]},{"name":"","children":[{"url":"https://bitbucket.org/tdelphi/lazy-delphi-builder-downloads/downloads","size":1,"name":"Lazy Delphi Builder","description":"Build tool for Delphi. Recompile projects/packages from sources with all dependencies, without need to mess around with configs. Quickly (re-)install components from sources into IDE, with no need to change your Library Path.\r"},{"url":"https://github.com/rruz/delphi-ide-theme-editor","size":1,"name":"Delphi IDE theme editor / Delphi IDE Colorizer","description":"Tool to change the IDE color highlighting of several Object Pascal IDE's like Delphi (RAD Studio), Appmethod, Lazarus  and Smart Mobile Studio. DITE supports Delphi 5-7, 2005-2010, XE-XE8, Appmethod 1.13-1.14, Lazarus v1.0.1.3 and Smart Mobile Studio IDE v1.1.2.17. The Delphi IDE Colorizer (DIC) is a plugin which allows to customize the look and feel of the workspace of the RAD Studio IDE and Appmethod.\r"},{"url":"http://andy.jgknet.de/blog/ide-tools/ddevextensions","size":1,"name":"DDevExtensions","description":"Extends the Delphi/C++Builder IDE by adding some new productivity features\r"},{"url":"http://andy.jgknet.de/blog/bugfix-units/vclfixpack-10","size":1,"name":"VCL Fix Pack","description":"Delphi unit that fixes VCL and RTL bugs at runtime by patching the original functions. If you want all IDE Fix Pack fixes in your application this unit is what you are looking for. Adding the unit to your project (Delphi and C++Builder) automatically installs the patches that are available for your Delphi/C++Builder version.\r"},{"url":"http://andy.jgknet.de/blog/ide-tools/ide-fix-pack","size":1,"name":"IDE Fix Pack","description":"Collection of unofficial bug fixes and performance optimizations for the RAD Studio IDE, Win32/Win64 compiler and Win32 debugger. IDE Fix Pack is an IDE plugin for RAD Studio 2009-XE6 that fixes IDE bugs at runtime. All changes are done in memory. No files on disk are modified. None of your projects are modified or benefit from the IDE Fix Pack other than being compiled faster. Only the IDE gets the fixes and optimizations.\r"},{"url":"https://sourceforge.net/projects/gexperts","size":1,"name":"GExperts","description":"Free set of tools built to increase the productivity of Delphi and C++Builder programmers by adding several features to the IDE. GExperts is developed as Open Source software and we encourage user contributions to the project. Grep search and replace supporting unicode files, DFMs, etc; Automatically rename components, insert text macros, open recent files; Easily backup your projects, with custom additional file lists; Keep nested lists of favorite files for quick access; Track dependencies between units in your project; Quickly jump to any procedure in the current unit; And much, much more...\r"},{"url":"https://github.com/cnpack","size":1,"name":"CnWizards","description":"Free Plug-in Tool Set for Delphi/C++ Builder/CodeGear RAD Studio to Improve Development Efficiency.\r"},{"url":"https://bitbucket.org/idursun/delphipi","size":1,"name":"Delphi Package Installer (DelphiPI)","description":"Tool which aids you installing components to your Delphi IDE. DelphiPI automatically resolves dependencies between packages, compiles, installs and adds source paths to your IDE.\r"},{"url":"https://github.com/chaosben/theunknownones","size":1,"name":"ResEd","description":"Expert for Delphi 2005, 2006, 2007, 2009, 2010 and XE. This expert is designed for editing the resource files (.res; .resx) that are linked to the active project. It will automatically search for all occurrences of {$R xyz.res} lines and will open/create resourcefiles for them. The expert registers itself in the menubar of Delphi under View.\r"},{"url":"http://www.jrsoftware.org/isinfo.php","size":1,"name":"Inno Setup","description":"Free installer for Windows programs. First introduced in 1997, Inno Setup today rivals and even surpasses many commercial installers in feature set and stability.\r"},{"url":"https://github.com/synopse/SynProject","size":1,"name":"SynProject","description":"[docs](http://synopse.info/fossil/wiki?name=SynProject)). Tool for code source versioning and automated documentation of Delphi projects.\r"},{"url":"https://parnassus.co/delphi-tools/bookmarks","size":1,"name":"Parnassus Bookmarks","description":"IDE plugin that extends bookmark functionality.\r"},{"url":"https://sourceforge.net/projects/pasdoc","size":1,"name":"PasDoc","description":"Documentation tool for ObjectPascal (FreePascal and Delphi) source code. Documentation is generated from comments found in source code. Available output formats are HTML, HtmlHelp, LaTeX, latex2rtf, simplexml. More output formats may be added in the future.\r"},{"url":"https://github.com/RRUZ/wmi-delphi-code-creator","size":1,"name":"WMI Delphi Code Creator","description":"Allows you to generate Object Pascal, Oxygene, C++ and C# code to access the WMI (Windows Management Instrumentation) classes, events and methods. Also includes a set of tools to explorer and Query the content of the WMI.\r"},{"url":"https://github.com/RRUZ/delphi-preview-handler","size":1,"name":"Delphi Preview Handler","description":"Preview handler for Windows Vista ,7 and 8 which allow you read your object pascal, C++ and Assembly code with Syntax highlighting without open in a editor\r"},{"url":"https://github.com/RRUZ/delphi-dev-shell-tools","size":1,"name":"Delphi Dev. Shell Tools","description":"Windows shell extension with useful tasks for Object Pascal Developers (Delphi, Free Pascal).\r"}]}]}